Revit 2027 API
BuiltInFailures.WallFailures.CannotRedoFaceToposolid Property
 "Faces defining this Roof cannot be reacquired. Either delete the Roof or leave as it is.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRedoFaceToposolid { get; }
Public Shared ReadOnly Property CannotRedoFaceToposolid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRedoFaceToposolid {
	FailureDefinitionId^ get ();
}
static member CannotRedoFaceToposolid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace